Masmiseim36/nxpSDK/boards/evkbmimxrt1170/el2go_examples/el2go_agent/cm7/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_25 (coord M15), LPUART1_RXD */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART1_RXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART1_RXD_SIGNAL                                    RXD   /*!< Signal name */
#define BOARD_INITPINS_LPUART1_RXD_PIN_NAME                           GPIO_AD_25   /*!< Routed pin name */
#define BOARD_INITPINS_LPUART1_RXD_LABEL                           "LPUART1_RXD"   /*!< Label */
#define BOARD_INITPINS_LPUART1_RXD_NAME                            "LPUART1_RXD"   /*!< Identifier */

/* GPIO_AD_24 (coord L13), LPUART1_TXD */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART1_TXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART1_TXD_SIGNAL                                    TXD   /*!< Signal name */
#define BOARD_INITPINS_LPUART1_TXD_PIN_NAME                           GPIO_AD_24   /*!< Routed pin name */
#define BOARD_INITPINS_LPUART1_TXD_LABEL                           "LPUART1_TXD"   /*!< Label */
#define BOARD_INITPINS_LPUART1_TXD_NAME                            "LPUART1_TXD"   /*!< Identifier */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

/* GPIO_DISP_B1_00 (coord E13), ENET_RGMII_RX_EN/U10[26] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_RX_EN_PERIPHERAL                 ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RX_EN_SIGNAL                  enet_rx_en   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RX_EN_PIN_NAME           GPIO_DISP_B1_00   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RX_EN_LABEL   "ENET_RGMII_RX_EN/U10[26]"   /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_RX_EN_NAME            "ENET_RGMII_RX_EN"   /*!< Identifier */

/* GPIO_DISP_B1_01 (coord D13), ENET_RGMII_RXC/U10[27] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXC_PERIPHERAL                   ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXC_SIGNAL                   enet_rx_clk   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXC_PIN_NAME             GPIO_DISP_B1_01   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXC_LABEL       "ENET_RGMII_RXC/U10[27]"   /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXC_NAME                "ENET_RGMII_RXC"   /*!< Identifier */

/* GPIO_DISP_B1_02 (coord D11), ENET_RGMII_RXD0/U10[25] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD0_PERIPHERAL                  ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD0_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD0_CHANNEL                          0U   /*!< Signal channel */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD0_PIN_NAME            GPIO_DISP_B1_02   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD0_LABEL     "ENET_RGMII_RXD0/U10[25]"   /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD0_NAME              "ENET_RGMII_RXD0"   /*!< Identifier */

/* GPIO_DISP_B1_03 (coord E11), ENET_RGMII_RXD1/U10[24] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD1_PERIPHERAL                  ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD1_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD1_CHANNEL                          1U   /*!< Signal channel */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD1_PIN_NAME            GPIO_DISP_B1_03   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD1_LABEL     "ENET_RGMII_RXD1/U10[24]"   /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD1_NAME              "ENET_RGMII_RXD1"   /*!< Identifier */

/* GPIO_DISP_B1_04 (coord E10), ENET_RGMII_RXD2/U10[23] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD2_PERIPHERAL                  ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD2_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD2_CHANNEL                          2U   /*!< Signal channel */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD2_PIN_NAME            GPIO_DISP_B1_04   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD2_LABEL     "ENET_RGMII_RXD2/U10[23]"   /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD2_NAME              "ENET_RGMII_RXD2"   /*!< Identifier */

/* GPIO_DISP_B1_05 (coord C11), ENET_RGMII_RXD3/U10[22] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD3_PERIPHERAL                  ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD3_SIGNAL                   enet_rdata   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD3_CHANNEL                          3U   /*!< Signal channel */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD3_PIN_NAME            GPIO_DISP_B1_05   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD3_LABEL     "ENET_RGMII_RXD3/U10[22]"   /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_RXD3_NAME              "ENET_RGMII_RXD3"   /*!< Identifier */

/* GPIO_DISP_B1_06 (coord D10), ENET_RGMII_TXD3/U10[15]/BT_CFG[0] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD3_PERIPHERAL                  ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD3_SIGNAL                   enet_tdata   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD3_CHANNEL                          3U   /*!< Signal channel */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD3_PIN_NAME            GPIO_DISP_B1_06   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD3_LABEL "ENET_RGMII_TXD3/U10[15]/BT_CFG[0]" /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD3_NAME              "ENET_RGMII_TXD3"   /*!< Identifier */

/* GPIO_DISP_B1_07 (coord E12), ENET_RGMII_TXD2/U10[16]/BT_CFG[1] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD2_PERIPHERAL                  ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD2_SIGNAL                   enet_tdata   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD2_CHANNEL                          2U   /*!< Signal channel */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD2_PIN_NAME            GPIO_DISP_B1_07   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD2_LABEL "ENET_RGMII_TXD2/U10[16]/BT_CFG[1]" /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD2_NAME              "ENET_RGMII_TXD2"   /*!< Identifier */

/* GPIO_DISP_B1_08 (coord A15), ENET_RGMII_TXD1/U10[17]/BT_CFG[2] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD1_PERIPHERAL                  ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD1_SIGNAL                   enet_tdata   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD1_CHANNEL                          1U   /*!< Signal channel */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD1_PIN_NAME            GPIO_DISP_B1_08   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD1_LABEL "ENET_RGMII_TXD1/U10[17]/BT_CFG[2]" /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD1_NAME              "ENET_RGMII_TXD1"   /*!< Identifier */

/* GPIO_DISP_B1_09 (coord C13), ENET_RGMII_TXD0/U10[18]/BT_CFG[3] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD0_PERIPHERAL                  ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD0_SIGNAL                   enet_tdata   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD0_CHANNEL                          0U   /*!< Signal channel */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD0_PIN_NAME            GPIO_DISP_B1_09   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD0_LABEL "ENET_RGMII_TXD0/U10[18]/BT_CFG[3]" /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXD0_NAME              "ENET_RGMII_TXD0"   /*!< Identifier */

/* GPIO_DISP_B1_10 (coord B14), ENET_RGMII_TX_EN/U10[19]/BT_CFG[4] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_TX_EN_PERIPHERAL                 ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TX_EN_SIGNAL                  enet_tx_en   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TX_EN_PIN_NAME           GPIO_DISP_B1_10   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TX_EN_LABEL "ENET_RGMII_TX_EN/U10[19]/BT_CFG[4]" /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_TX_EN_NAME            "ENET_RGMII_TX_EN"   /*!< Identifier */

/* GPIO_DISP_B1_11 (coord A14), ENET_RGMII_TXC/U10[20]/BT_CFG[5] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXC_PERIPHERAL                   ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXC_SIGNAL                enet_tx_clk_io   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXC_PIN_NAME             GPIO_DISP_B1_11   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXC_LABEL "ENET_RGMII_TXC/U10[20]/BT_CFG[5]" /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_TXC_NAME                "ENET_RGMII_TXC"   /*!< Identifier */

/* GPIO_DISP_B2_13 (coord A5), INT1_COMBO/BT_UART_RTS/U354[5]/ETHPHY_RST_B/U10[12] */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_BT_UART_RTS_PERIPHERAL                       GPIO11   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_BT_UART_RTS_SIGNAL                          gpio_io   /*!< Signal name */
#define BOARD_INITENET1GPINS_BT_UART_RTS_CHANNEL                             14U   /*!< Signal channel */
#define BOARD_INITENET1GPINS_BT_UART_RTS_PIN_NAME                GPIO_DISP_B2_13   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_BT_UART_RTS_LABEL "INT1_COMBO/BT_UART_RTS/U354[5]/ETHPHY_RST_B/U10[12]" /*!< Label */
#define BOARD_INITENET1GPINS_BT_UART_RTS_NAME                      "BT_UART_RTS"   /*!< Identifier */

/* Symbols to be used with GPIO driver */
#define BOARD_INITENET1GPINS_BT_UART_RTS_GPIO                             GPIO11   /*!< GPIO peripheral base pointer */
#define BOARD_INITENET1GPINS_BT_UART_RTS_GPIO_PIN                            14U   /*!< GPIO pin number */
#define BOARD_INITENET1GPINS_BT_UART_RTS_GPIO_PIN_MASK               (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_19 (coord U2), ENET_RGMII_MDC */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDC_PERIPHERAL                   ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDC_SIGNAL                      enet_mdc   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDC_PIN_NAME              GPIO_EMC_B2_19   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDC_LABEL               "ENET_RGMII_MDC"   /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDC_NAME                "ENET_RGMII_MDC"   /*!< Identifier */

/* GPIO_EMC_B2_20 (coord R3), ENET_RGMII_MDIO */
/* Routed pin properties */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDIO_PERIPHERAL                  ENET_1G   /*!< Peripheral name */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDIO_SIGNAL                    enet_mdio   /*!< Signal name */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDIO_PIN_NAME             GPIO_EMC_B2_20   /*!< Routed pin name */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDIO_LABEL             "ENET_RGMII_MDIO"   /*!< Label */
#define BOARD_INITENET1GPINS_ENET_RGMII_MDIO_NAME              "ENET_RGMII_MDIO"   /*!< Identifier */

/*!
 * @brief Configures pin routing and optionally pin electrical features for the 1G ENET port.
 *
 */
void BOARD_InitEnet1GPins(void);              /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
